export const CONTEST_DATA = {
  title: '제 5회 대학(원)생 아이디어 소논문 공모전',
  images: [
    'https://thumb.mt.co.kr/06/2017/10/2017101714471864350_1.jpg/dims/optimize/',
    'https://thumb.mt.co.kr/06/2017/10/2017101714471864350_1.jpg/dims/optimize/',
  ],
  data: '더미데이터더미데이터더미데이\n터더미데이터더\n미데이터\n더미데이터더미데이터더\n미데이터더미데이터더\n미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이\n터더미데이터더\n미데이터\n더미데이터더미데이터더\n미데이터더미데이터더\n미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이\n터더미데이터더\n미데이터\n더미데이터더미데이터더\n미데이터더미데이터더\n미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이\n터더미데이터더\n미데이터\n더미데이터더미데이터더\n미데이터더미데이터더\n미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터더미데이터',
  remainDay: 8,
};
